app/controllers/ingratitudes_controller.rb

    def set_ingratitude
        @ingratitude = Ingratitude.find_by(id: params[:id])
---
SELECT "ingratitudes".* FROM "ingratitudes" WHERE "ingratitudes"."id" IS NULL LIMIT ?  [["LIMIT", 1]]